src/test/resources/itm/response-prod.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Body>
		<SOAP-CHK:Success
			xmlns:SOAP-CHK="http://soaptest1/soaptest/"
			xmlns="urn:candle-soap:attributes">
			<TABLE name="O4SRV.ISITSTSH">
				<OBJECT>O4SRV.ISITSTSH</OBJECT>
				<DATA>
					<ROW>
						<HGBLTMSTMP>1190507085355117</HGBLTMSTMP>
						<HSITNAME>REAL_MUT_HABackend_Critical</HSITNAME>
						<HDELTASTAT>Y</HDELTASTAT>
						<HNODE>TEMSP4</HNODE>
						<HORIGINNODE>S302LXHAINTRA01:64</HORIGINNODE>
					</ROW>
					<ROW>
						<HGBLTMSTMP>1190507085355117</HGBLTMSTMP>
						<HSITNAME>REAL_TEST2_NOTIF_SMS</HSITNAME>
						<HDELTASTAT>Y</HDELTASTAT>
						<HNODE>TEMSP4</HNODE>
						<HORIGINNODE>toto:s301lfahades1:64</HORIGINNODE>
					</ROW>
					<ROW>
						<HGBLTMSTMP>1190507085355117</HGBLTMSTMP>
						<HSITNAME>REAL_TEST1_NOTIF_SMS</HSITNAME>
						<HDELTASTAT>Y</HDELTASTAT>
						<HNODE>TEMSP4</HNODE>
						<HORIGINNODE>toto:s301lfahades1:64</HORIGINNODE>
					</ROW>
					<ROW>
						<HGBLTMSTMP>1190507085355117</HGBLTMSTMP>
						<HSITNAME>REAL_TEST2_NOTIF_SMS</HSITNAME>
						<HDELTASTAT>Y</HDELTASTAT>
						<HNODE>TEMSP4</HNODE>
						<HORIGINNODE>toto:s301lfahades1:64</HORIGINNODE>
					</ROW>
					<ROW>
						<HGBLTMSTMP>1190507085355117</HGBLTMSTMP>
						<HSITNAME>REAL_TEST1_NOTIF_SMS</HSITNAME>
						<HDELTASTAT>Y</HDELTASTAT>
						<HNODE>TEMSP4</HNODE>
						<HORIGINNODE>toto:s301lfahades1:64</HORIGINNODE>
					</ROW>
				</DATA>
			</TABLE>
		</SOAP-CHK:Success>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>